ИС_СПОРТ_2022/src/Reports/ЧисленностьЗанимающихсяПоПрограммамСпортивнойПодготовки/ЧисленностьЗанимающихсяПоПрограммамСпортивнойПодготовки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЧисленностьЗанимающихсяПоПрограммамСпортивнойПодготовки</name>
</mdclass:Report>

ИС_СПОРТ_2022/src/Catalogs/Спортсмены/Спортсмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спортсмены</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСпортсмена</name>
    <type>
      <types>EnumRef.СтатусыСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонДиспансеризации</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>СовпадаетАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОсобенностиЗдоровья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяИнвалидностьПоОбщемуЗаболеванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеютсяИнтеллектуальныеНарушения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеЗрения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеСлуха</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеОДА</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПФЗ</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиФизическогоЗдоровья</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Reports/ЧисленностьЗанимающихсяПоПрограммамСпортивнойПодготовки/Forms/ФормаРасшифровки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СхемаКомпоновкиДанных = Отчеты.ЧисленностьЗанимающихсяПоПрограммамСпортивнойПодготовки.ПолучитьМакет("РасшифровкаДанных");
	ПараметрыОтчёта = СхемаКомпоновкиДанных.Параметры;
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
	ПараметрыОтчёта.Период.Значение 	 = Параметры.Период;

	Массив = МассивДанных();
	Для каждого Элемент Из Массив Цикл
		Если Параметры.Свойство(Элемент) Тогда
			Если Элемент = "ВидСпорта" Тогда
				Отбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидСпорта");
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				Отбор.ПравоеЗначение = Параметры.ВидСпорта;
				Отбор.Использование = Истина;
			Иначе
				Отбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент);
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				Отбор.ПравоеЗначение = 1;
				Отбор.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	МакетКомпоновки.ЗначенияПараметров.Период.Значение = Параметры.Период;
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	Результат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	АвтоЗаголовок = Ложь;
	Заголовок = НСтр("ru = 'Численность занимающихся по программам спортивной подготовки (расшифровка)'");
	
КонецПроцедуры

Функция МассивДанных()
	Массив = Новый Массив;
	Массив.Добавить("ВидСпорта");
	Массив.Добавить("НеОтчислен");
	Массив.Добавить("ЭтапСОГ");
	Массив.Добавить("ЭтапНП1");
	Массив.Добавить("ЭтапНП2");
	Массив.Добавить("ЭтапНП3");
	Массив.Добавить("ЭтапТ1");
	Массив.Добавить("ЭтапТ2");
	Массив.Добавить("ЭтапТ3");
	Массив.Добавить("ЭтапТ4");
	Массив.Добавить("ЭтапТ5");
	Массив.Добавить("ЭтапССМ1");
	Массив.Добавить("ЭтапССМ2");
	Массив.Добавить("ЭтапССМ3");
	Массив.Добавить("ЭтапССМ4");
	Массив.Добавить("ЭтапССМ5");
	Массив.Добавить("ЭтапВСМ1");
	Массив.Добавить("ЭтапВСМ2");
	Массив.Добавить("ЭтапВСМ3");
	Массив.Добавить("ЭтапВСМ4");
	Массив.Добавить("ЭтапВСМ5");
	Массив.Добавить("ЭтапыНП");
	Массив.Добавить("ЭтапыТ");
	Массив.Добавить("ЭтапыССМ");
	Массив.Добавить("ЭтапыВСМ");
	Массив.Добавить("ОтчисленВЭтомГоду");
	Массив.Добавить("ЭтапыОтчисленныеСОГ");
	Массив.Добавить("ЭтапыОтчисленныеНП");
	Массив.Добавить("ЭтапыОтчисленныеТ");
	Массив.Добавить("ЭтапыОтчисленныеССМ");
	Массив.Добавить("ЭтапыОтчисленныеВСМ");
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", РаботаемСРасшифровкойНаСервере(Расшифровка));
	ОткрытьФорму("Справочник.Спортсмены.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РаботаемСРасшифровкойНаСервере(Расшифровка)
	
	Возврат Справочники.Спортсмены.НайтиПоНаименованию(Расшифровка);
	
КонецФункции
